# 풀이

"""
k i j
1. (0, 0, . )일 때, arr(0, 0)이 0이므로 and는 항상 False -> j와 관계 없이 성립하지 않음
2. (0, 1, . )일 때, arr(1, 0)이 1이므로 arr(0, j)가 1일 때 True -> j가 2일 때 True -> arr(1, 2) = 1

0 0 1
1 0 1
0 1 0

3. (0, 2, . )일 때, arr(2, 0)은 0이므로 항상 False
4. (1, 0, . )일 때, arr(0, 1)은 0이므로 항상 False
5. (1, 1, . )일 때, arr(1, 1)은 0이므로 항상 False
6. (1, 2, . )일 때, arr(2, 1)은 1이므로 -> arr(1, j)가 1일 때 True -> j가 0과 2일 때 True
j가 0인 경우 arr(2, 0) = 1

0 0 1
1 0 1
1 1 0

j가 2인 경우 arr(2, 2) = 1

0 0 1
1 0 1
1 1 1

7. (2, 0, . )일 때, arr(0, 2)는 1이므로 -> arr(2, j)가 1일 때 True -> j가 0, 1, 2일 때 모두 True

j가 0인 경우 arr(0, 0) = 1

1 0 1
1 0 1
1 1 1

j가 1인 경우 arr(0, 1) = 1

1 1 1
1 0 1
1 1 1

j가 2인 경우 arr(0, 2) = 1

동일함

8. (2, 1, . )일 때, arr(1, 2)는 1이므로 -> arr(2, j)가 1일 때 True -> j가 0, 1, 2일 때 모두 True
j가 0인 경우 arr(1, 0) = 1
j가 1인 경우 arr(1, 1) = 1

1 1 1
1 1 1
1 1 1

이제 이 다음부터는 고려할 필요 없음
"""
